---
type: WorksetDefaultVisibilitySettings
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# WorksetDefaultVisibilitySettings

`Autodesk.Revit.DB.WorksetDefaultVisibilitySettings` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetWorksetDefaultVisibilitySettings | 2012 | `public static WorksetDefaultVisibilitySettings GetWorksetDefaultVisibilitySettings ( Document aDoc )` |
| Method | IsWorksetVisible | 2012 | `public bool IsWorksetVisible ( WorksetId worksetId )` |
| Method | SetWorksetVisibility | 2012 | `public void SetWorksetVisibility ( WorksetId worksetId , bool visible )` |
| Property | Parameter | — | `` |